# AreaForceScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..AreaForceScale Property
SpecTypeId Class See Also
---
Area Force Scale, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId AreaForceScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaForceScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AreaForceScale {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace